Repository: microsoft/botbuilder-dotnet
Catalog: libraries/Microsoft.Bot.Builder.Classic/Microsoft.Bot.Builder.Classic/Resource/Resources.*.resx
Languages: de_de, es, ja, pt_br

# CommandBack
source: Back
de_de: Zurück
es: Regresar
ja: 戻る
pt_br: Voltar

# CommandBackHelp
source: Back: Go back to the previous question.
de_de: Zurück: Gehe zurück zum letzten Feld.
es: Regresar: Regresar a la pregunta anterior.
ja: 戻る: 前の質問に戻る。
pt_br: Voltar: Voltar para a pergunta anterior.

# CommandBackTerms
source: backup;go back;back
de_de: zurück;gehe zurück;gehe rückwärts;rückwärts
es: regresar; ir de regreso; regresear; retornar; ir para atrás;
ja: 戻る
pt_br: voltar;retornar;anterior;ir para anterior;voltar para anterior;pergunta anterior

# CommandHelp
source: Help
de_de: Hilfe
es: Ayuda
ja: ヘルプ
pt_br: Ajuda

# CommandHelpHelp
source: Help: Show the kinds of responses you can enter.
de_de: Hilfe: Zeigt die verschiedenen Möglichkeiten die du eingeben kannst.
es: Ayuda: Muestra el tipo de respuestas que puedes dar.
ja: ヘルプ: いろいろな返答を表示
pt_br: Ajuda: Exibe os tipos de respostas que você pode inserir.

# CommandHelpTerms
source: help;choices;\?
de_de: hilfe;möglichkeiten;\?
es: ayuda;opciones;\?;¿
ja: ヘルプ; 選択肢; \?
pt_br: ajuda;opções;não entendi;\?

# CommandQuit
source: Quit
de_de: Stop
es: Salir
ja: 終了
pt_br: Sair

# CommandQuitHelp
source: Quit: Quit the form without completing it.
de_de: Stop: Beendet das Formular ohne es zu vervollständigen.
es: Salir: Salir del formulario sin terminarlo.
ja: 終了: 完了せず、フォームを終了
pt_br: Sair: Sair do formulário sem completá-lo.

# CommandQuitTerms
source: quit;stop;finish;goodby?;good bye?;bye;ciao;adios;bye-bye;so long;cheers
de_de: stop;halt;tschüss
es: salir; detener;finalizar;fin;diós; adios;chau;hasta luego;hasta la proxima;bye;hasta luego
ja: 終了; 停止; ストップ; さよなら;バイバイ;チャオ;アディオス
pt_br: sair;cancelar;parar;terminar;finalizar;encerrar;bye;tchau?;adeus;flw;t+;até mais

# CommandReset
source: Start over
de_de: Neu starten
es: Comenzar de nuevo
ja: 最初からやり直す
pt_br: Recomeçar

# CommandResetHelp
source: Reset: Start over filling in the form. (With defaults from your previous entries.)
de_de: Neu starten: Das Formular nochmal von Anfang an starten. (Mit den Standardwerten von deinen früheren Eingaben.)
es: Reiniciar: Empezar de nuevo a llenar el formulario. (Con los valores predeterminados con anterioridad).
ja: リセット: フォームを最初からやり直す。 (前のエントリをデフォルトで)
pt_br: Recomeçar: Recomeçar o preenchimento do formulário. (Com valores predeterminados baseados no preenchimento anterior.)

# CommandResetTerms
source: start over;reset;clear
de_de: neu starten;reset;neu
es: volver a empezar; restablecer; limpiar; reiniciar
ja: やり直す;リセット;クリア
pt_br: reiniciar;recomeçar;resetar;limpar;iniciar novamente;começar novamente

# CommandStatus
source: Status
es: Estado
ja: ステータス
pt_br: Situação

# CommandStatusHelp
source: Status: Show your progress in filling in the form so far.
de_de: Status: Zeigt deinen jetztigen Stand beim Ausfüllen des Formulars.
es: Estado: Muestra el progreso en el llenado de la forma hasta ahora.
ja: ステータス: フォーム記入の進行状況を表示
pt_br: Situação: Exibe o progresso no preenchimento do formulário até o momento.

# CommandStatusTerms
source: status;progress;so far;results
de_de: status;stand;fortschritt;ergebnis
es: Estado de progreso; hasta ahora; resultados;estado
ja: ステータス; 進行状況;現在状況; 結果
pt_br: situação;progresso;resultados

# DefaultChoiceLastSeparator
source: , or
de_de: ,oder
es: , o
ja: 、または
pt_br: , ou

# DefaultLastSeparator
source: , and
de_de: ,und
es: , y
ja: 、と
pt_br: e

# LanguageArticles
source: a;an;the
de_de: der;die;das;ein;eine;eines;einer
es: un; una; la; el
pt_br: um;uma;uns;umas;o;a;os;as

# LanguageStopWords
source: a;about;above;above;across;after;afterwards;again;against;all;almost;alone;along;already;also;although;always;am;among;amongst;amoungst;amount;an;and;another;any;anyhow;anyone;anything;anyway;anywhere;are;around;as;at;back;be;became;because;become;becomes;becoming;been;before;beforehand;behind;being;below;beside;besides;between;beyond;bill;both;bottom;but;by;call;can;cannot;cant;co;con;could;couldnt;cry;de;describe;detail;do;done;down;due;during;each;eg;eight;either;eleven;else;elsewhere;empty;enough;etc;even;ever;every;everyone;everything;everywhere;except;few;fifteen;fify;fill;find;fire;first;five;for;former;formerly;forty;found;four;from;front;full;further;get;give;go;had;has;hasnt;have;he;hence;her;here;hereafter;hereby;herein;hereupon;hers;herself;him;himself;his;how;however;hundred;ie;if;in;inc;indeed;interest;into;is;it;its;itself;keep;last;latter;latterly;least;less;ltd;made;many;may;me;meanwhile;might;mill;mine;more;moreover;most;mostly;move;much;must;my;myself;name;namely;neither;never;nevertheless;next;nine;no;nobody;none;noone;nor;not;nothing;now;nowhere;of;off;often;on;once;one;only;onto;or;other;others;otherwise;our;ours;ourselves;out;over;own;part;per;perhaps;please;put;rather;re;same;see;seem;seemed;seeming;seems;serious;several;she;should;show;side;since;sincere;six;sixty;so;some;somehow;someone;something;sometime;sometimes;somewhere;still;such;system;take;ten;than;that;the;their;them;themselves;then;thence;there;thereafter;thereby;therefore;therein;thereupon;these;they;thick;thin;third;this;those;though;three;through;throughout;thru;thus;to;together;too;top;toward;towards;twelve;twenty;two;un;under;until;up;upon;us;very;via;was;we;well;were;what;whatever;when;whence;whenever;where;whereafter;whereas;whereby;wherein;whereupon;wherever;whether;which;while;whither;who;whoever;whole;whom;whose;why;will;with;within;without;would;yet;you;your;yours;yourself;yourselves
de_de: aber;als;am;an;auch;auf;aus;bei;bin;bis;bist;da;dadurch;daher;darum;das;daß;dass;dein;deine;dem;den;der;des;dessen;deshalb;die;dies;dieser;dieses;doch;dort;du;durch;ein;eine;einem;einen;einer;eines;er;es;euer;eure;für;hatte;hatten;hattest;hattet;hier;hinter;ich;ihr;ihre;im;in;ist;ja;jede;jedem;jeden;jeder;jedes;jener;jenes;jetzt;kann;kannst;können;könnt;machen;mein;meine;mit;muß;mußt;musst;müssen;müßt;nach;nachdem;nein;nicht;nun;oder;seid;sein;seine;sich;sie;sind;soll;sollen;sollst;sollt;sonst;soweit;sowie;und;unser;unsere;unter;vom;von;vor;wann;warum;was;weiter;weitere;wenn;wer;werde;werden;werdet;weshalb;wie;wieder;wieso;wir;wird;wirst;wo;woher;wohin;zu;zum;zur;über
es: un;una;unas;unos;uno;sobre;todo;también;tras;otro;algún;alguno;alguna;algunos;algunas;ser;es;soy;eres;somos;sois;estoy;esta;estamos;estais;estan;como;en;para;atras;porque;por;qué;estado;estaba;ante;antes;siendo;ambos;pero;por;poder;puede;puedo;podemos;podeis;pueden;fui;fue;fuimos;fueron;hacer;hago;hace;hacemos;haceis;hacen;cada;fin;incluso;primero;desde;conseguir;consigo;consigue;consigues;conseguimos;consiguen;ir;voy;va;vamos;vais;van;vaya;gueno;ha;tener;tengo;tiene;tenemos;teneis;tienen;el;la;lo;las;los;su;aqui;mio;tuyo;ellos;ellas;nos;nosotros;vosotros;vosotras;si;dentro;solo;solamente;saber;sabes;sabe;sabemos;sabeis;saben;ultimo;largo;bastante;haces;muchos;aquellos;aquellas;sus;entonces;tiempo;verdad;verdadero;verdadera;cierto;ciertos;cierta;ciertas;intentar;intento;intenta;intentas;intentamos;intentais;intentan;dos;bajo;arriba;encima;usar;uso;usas;usa;usamos;usais;usan;emplear;empleo;empleas;emplean;ampleamos;empleais;valor;muy;era;eras;eramos;eran;modo;bien;cual;cuando;donde;mientras;quien;con;entre;sin;trabajo;trabajar;trabajas;trabaja;trabajamos;trabajais;trabajan;podria;podrias;podriamos;podrian;podriais;yo;aquel
pt_br: a;ainda;além;ambas;ambos;antes;ao;aonde;aos;após;aquela;aquelas;aquele;aqueles;aquilo;as;assim;até;com;como;contra;contudo;cuja;cujas;cujo;cujos;da;das;de;dela;delas;dele;deles;demais;depois;desde;desta;deste;dispõe;dispõem;diversa;diversas;diversos;do;dos;durante;e;ela;elas;ele;eles;em;entre;entretanto;então;era;eram;essa;essas;esse;esses;esta;estamos;estas;estava;estavam;este;esteja;estejam;estejamos;estes;esteve;estive;estivemos;estiver;estivera;estiveram;estiverem;estivermos;estivesse;estivessem;estivéramos;estivéssemos;estou;está;estávamos;estão;eu;foi;fomos;for;fora;foram;forem;formos;fosse;fossem;fui;fôramos;fôssemos;gente;há;haja;hajam;hajamos;havemos;havia;hei;houve;houvemos;houver;houvera;houveram;houverei;houverem;houveremos;houveria;houveriam;houvermos;houverá;houverão;houveríamos;houvesse;houvessem;houvéramos;houvéssemos;há;hão;isso;isto;já;lhe;lhes;logo;mais;mas;me;mediante;menos;mesma;mesmas;mesmo;mesmos;meu;meus;minha;minhas;muito;na;nas;nem;nesse;neste;no;nos;nossa;nossas;nosso;nossos;num;numa;não;nós;o;os;ou;outra;outras;outro;outros;para;pela;pelas;pelo;pelos;perante;pois;por;porque;porquê;portanto;porém;próprios;próprio;quais;qual;qualquer;quando;quanto;que;quem;quer;se;seja;sejam;sejamos;sem;sendo;ser;serei;seremos;seria;seriam;será;serão;seríamos;seu;seus;sob;sobre;somos;sou;sua;suas;são;só;tal;também;te;tem;temos;tenha;tenham;tenhamos;tenho;ter;terei;teremos;teria;teriam;terá;terão;teríamos;teu;teus;teve;tinha;tinham;tive;tivemos;tiver;tivera;tiveram;tiverem;tivermos;tivesse;tivessem;tivéramos;tivéssemos;toda;todas;todo;todos;tu;tua;tuas;tudo;têm;tínhamos;um;uma;umas;uns;você;vocês;vos;à;às;é;éramos;vc;vcs;td;tb;q

# MatchCurrentChoice
source: Current Choice('c');current;c;current choice;no change
de_de: Aktuelle Auswahl('a');aktuell;a;aktuelle auswahl
es: Opción actual ('a'); corriente; a; elección actual, sin cambios
ja: 現在の選択('c'); 現在; c; 現在の選択;変更なし
pt_br: Opção atual ('a');atual;a;opção atual;sem alteração;sem mudança;sem mudar;sem alterar

# MatchNo
source: No;n;nope;2
de_de: Nein;n;nö;ne;2
es: No; n;nop;2
ja: いいえ;2
pt_br: Não;nao;n;incorreto;errado;2

# MatchNoPreference
source: No Preference;no;none;I don'?t care
de_de: Egal;keine;nichts;mir egal;ist egal
es: Sin preferencia; no; no; nada; no me importa
ja: どちらとも言えない; いいえ; なし; どちらでも良い
pt_br: Sem preferência;não;qualquer um;qualquer uma;qualquer;tanto faz;Eu não me importo

# MatchYes
source: Yes;y;sure;ok;yep;1
de_de: Ja;j;klar;ok;jo;1
es: Sí;claro;seguro;ok; sí;si;1
ja: はい; もちろん; ok;1
pt_br: Sim;s;correto;certo;claro;com certeza;ok;isso;1

# PromptRetry
source: I didn't understand. Say something in reply.
de_de: Das hab ich nicht verstanden. Sag nochmal was.
es: No entendí. Di algo como respuesta.
ja: わからない。何か返答して下さい。
pt_br: Não entendi. Tente dizer de outra forma.

# TemplateBool
source: Would you like a {&}? {||}
de_de: Möchtest du ein {&}? {||}
es: ¿Te gustaría un {&}? {||}
ja: {&} 欲しいですか{||}
pt_br: Gostaria de {&}? {||}

# TemplateBoolHelp
source: Please enter 'yes' or 'no'{?, {0}}.
de_de: Bitte gib 'ja' oder 'nein' ein{?,{0}}.
es: Teclea 'sí' o 'no'{?, {0}}.
ja: 'はい' または 'いいえ' を入力してください {?、{0}}。
pt_br: Por favor, responda 'sim' ou 'não'{?, {0}}.

# TemplateClarify
source: By "{0}" {&} did you mean {||}
de_de: Mit "{0}" {&} hast du {||} gemeint
es: Al decir "{0}" {&} te refieres a {||}
ja: 「{0}」{&} {||} を意味するか
pt_br: Com {&} "{0}" você quiz dizer {||}

# TemplateCurrentChoice
source: (current choice: {})
de_de: (Aktuelle Auswahl: {})
es: (elección actual: {})
ja: (現在の選択: {})
pt_br: (opção atual: {})

# TemplateDateTime
source: Please enter a date and time for {&} {||}
de_de: Bitte gib ein Datum und einer Uhrzeit für {&} ein {||}
es: Por favor introduzca la fecha y hora para {&} {||}
ja: {&} {||} の日付と時刻 を入力してください。
pt_br: Por favor, informe a data e hora para {&} {||}

# TemplateDateTimeHelp
source: Please enter a date or time expression {?, {0}}{?, {1}}.
de_de: Bitte gib ein Datum oder eine Uhrzeit ein {?,{0}}{?,{1}}.
es: Introduce una expresión de dia u hora {?, {0}} {?, {1}}.
ja: 日付または時刻の式を入力してください {?、{0}} {?、{1}}。
pt_br: Por favor, preencha no formato de data ou hora {?, {0}}{?, {1}}.

# TemplateDouble
source: Please enter a number {?between {0:F1} and {1:F1}} for {&} {||}
de_de: Bitte gib eine Nummer zwischen {?between {0:F1} und {1:F1}} für {&} ein {||}
es: Introduce un número {?entre {0:F1} y {1:F1}} para {&} {||}
ja: {&}の{?{0:F1}と{1:F1}のあいだ}の数を入力してください {||}
pt_br: Por favor, informe um número {?entre {0:F1} e {1:F1}} para {&} {||}

# TemplateDoubleHelp
source: Please enter a number{? between {2:F1} and {3:F1}}{?, {0}}{?, {1}}.
de_de: Bitte gib eine Nummer{? zwischen {2:F1} und {3:F1}} ein{?,{0}}{?,{1}}.
es: Introduce un número {? entre {2:F1} y {3:F1}} {?, {0}} {?, {1}}.
ja: 数値を入力してください {? {2:F1} の間と {3:F1}} {?、{0}} {?、{1}}。 {?{2:F1}と{3:F1}のあいだ}の数を入力してください{||}
pt_br: Por favor, informe um número{? entre {2:F1} e {3:F1}}{?, {0}}{?, {1}}.

# TemplateEnumManyNumberHelp
source: You can enter one or more numbers {0}-{1} or words from the descriptions. ({2})
de_de: Du kannst eine oder mehrere Nummern {0}-{1} oder Wörter aus den Beschreibungen eingeben. ({2})
es: Puede introducir uno o más números del {0}-{1} o palabras de las descripciones. ({2})
ja: 1 つを入力することができますまたはより多くの番号 {0}-{1} または言葉の説明から。({2})
pt_br: Você pode informar um ou mais números de {0}-{1} ou palavras das descrições. ({2})

# TemplateEnumManyWordHelp
source: You can enter in one or more selections from the descriptions. ({2})
de_de: Du kannst eine Auswahl oder mehrere aus den Beschreibungen treffen. ({2})
es: Puede seleccionar una o más opciones de las descripciones. ({2})
ja: 説明から 1 つまたは複数の選択で入力できます。({2})
pt_br: Você pode informar uma ou mais opções da descrição. ({2})

# TemplateEnumOneNumberHelp
source: You can enter a number {0}-{1} or words from the descriptions. ({2})
de_de: Du kannst eine Zahl von {0}-{1} oder Wörter aus der Beschreibung eingeben. ({2})
es: Puedes ingresar un número de {0}-{1} o palabras de las descripciones. ({2})
ja: 番号 {0} を入力することができます-{1} または言葉の説明から。({2})
pt_br: Você pode informar um número de {0}-{1} ou palavras das descrições. ({2})

# TemplateEnumOneWordHelp
source: You can enter in any words from the descriptions. ({2})
de_de: Du kannst alle Wörter aus den Beschreibungen eingeben. ({2})
es: Puede ingresar cualquiera de las palabras de las descripciones. ({2})
ja: 任意の言葉での説明から入力できます。({2})
pt_br: Você pode informar quaisquer palavras das descrições. ({2})

# TemplateEnumSelectMany
source: Please select one or more {&} {||}
de_de: Bitte wähle einen oder mehrere {&} {||}
es: Por favor seleccione una o más {&} {||}
ja: 1 つまたは複数 {&}を選択してください {||}
pt_br: Por favor, selecione um(a) ou mais {&} {||}

# TemplateEnumSelectOne
source: Please select a {&} {||}
de_de: Bitte wähle ein {&} {||}
es: Por favor seleccione un {&} {||}
ja: {&}を選択してください {||}
pt_br: Por favor, selecione um(a) {&} {||}

# TemplateFeedback
source: For {&} I understood {}. {?"{0}" is not an option.}
de_de: Für {&} hab ich {} verstanden. {?"{0}" ist keine Möglichkeit.}
es: Entendí {&} como {}. {? " {0} "no es una opción.}
ja: {&} に {} がわかった{?」{0}"オプションではありません}。
pt_br: Com {&} eu entendi {}. {?"{0}" não é uma opção.}

# TemplateHelp
source: You are filling in the {&} field. Possible responses: {0} {1}
de_de: Du füllst das Feld "{&}". Mögliche Antworten: {0} {1}
es: Estás llenando en el campo {&}. Posibles respuestas: {0} {1}
ja: {&}のフィールドに記入しています。 可能な応答: {0} {1}
pt_br: Você está preenchendo o campo {&}. Respostas possíveis: {0} {1}

# TemplateHelpClarify
source: You are clarifying a {&} value. Possible responses: {0} {1}
de_de: Du verdeutlichst ein {&} Wert. Mögliche Antworten: {0} {1}
es: Estas clarificando un valor de {&}. Posibles respuestas: {0} {1}
ja: {&} 値を明らかにしています。 可能な応答: {0} {1}
pt_br: Você está confirmando o valor do campo {&}. Respostas possíveis: {0} {1}

# TemplateHelpConfirm
source: Please answer the question. Possible responses: {0} {1}
de_de: Bitte beantworte die Frage. Mögliche Antworten: {0} {1}
es: Por favor responda a la pregunta. Posibles respuestas: {0} {1}
ja: 質問に答えてください。 可能な応答: {0} {1}
pt_br: Por favor, responda a pergunta. Respostas possíveis: {0} {1}

# TemplateHelpNavigation
source: Choose what field to change. Possible responses: {0} {1}
de_de: Wähle aus welches Feld du ändern möchtest. Mögliche Antworten: {0} {1}
es: Elegir qué campo cambiar. Posibles respuestas: {0} {1}
ja: 変更するフィールドを選択。 可能な応答: {0} {1}
pt_br: Escolha qual campo corrigir. Respostas possíveis: {0} {1}

# TemplateInteger
source: Please enter a number{? between {0} and {1}} for {&} {||}
de_de: Bitte gib eine Nummer{? zwischen {0} und {1}} für {&} ein {||}
es: Introduzca un número {? entre {0} y {1}} para {&} {||}
ja: {? {0}と{1}の間}の数を入力してください {&} {||}
pt_br: Por favor, informe um número{? entre {0} e {1}} para {&} {||}

# TemplateIntegerHelp
source: You can enter a number{? between {2} and {3}}{?, {0}}{?, {1}}.
de_de: Du kannst eine Nummer{? zwischen {2} und {3}} eingeben{?,{0}}{?,{1}}.
es: Inrtoduzca un número {? entre {2} y {3}} {?, {0}} {?, {1}}.
ja: {? {2}と{3}の間}の数を入力することができます {?、{0}} {?、{1}}。
pt_br: Você pode informar um número{? entre {2} e {3}}{?, {0}}{?, {1}}.

# TemplateNavigation
source: What do you want to change? {||}
de_de: Was möchtest du ändern? {||}
es: ¿Qué desea cambiar? {||}
ja: 何を変更したいですか。{||}
pt_br: O que você quer corrigir? {||}

# TemplateNavigationCommandHelp
source: You can switch to another field by entering its name. ({0}).
de_de: Du kannst zu einem anderen Feld wechseln indem du dessen Namen eingibst. ({0}).
es: Puede cambiar a otro campo introduciendo su nombre. ({0}).
ja: その名を入力して、別のフィールドを切り替えることができます。({0})。
pt_br: Você pode ir para outro campo informando o nome dele. ({0}).

# TemplateNavigationHelp
source: Choose {?a number from {0}-{1}, or} a field name.
de_de: Wähle{? eine Nummer von {0} bis {1},oder} der Name eines Feldes.
es: Seleccione {? un número de {0}-{1}, o} un nombre de campo.
ja: {? {0}から-{1}の数、または} フィールド名を選択
pt_br: Selecione {?um número de {0}-{1}, or} o nome de um campo.

# TemplateNoPreference
source: No Preference
de_de: Egal
es: Sin preferencia
ja: 優先設定なし
pt_br: Sem Preferência

# TemplateNotUnderstood
source: "{0}" is not a {&} option.
de_de: "{0}" ist keine Möglichkeit für {&}.
es: "{0}" no es una opción de {&}.
ja: "{0}"は{&}のオプションではありません。
pt_br: "{0}" não é uma opção de {&}.

# TemplateString
source: Please enter {&} {||}
de_de: Bitte gib {&} ein{||}
es: Escriba {&} {||}
ja: {&}を入力してください {||}
pt_br: Por favor, informe {&} {||}

# TemplateStringHelp
source: You can enter anything (use "'s to force string){?, {0}}{?, {1}}.
de_de: Du kannst alles eingeben (verwende Anführungszeichen " um eine Zeichenfolge zu erzwingen){?,{0}}{?,{1}}.
es: Puede escribir cualquier cosa (use " para forzar su entrada) {?, {0}} {?, {1}}.
ja: 何でも入力することができます (使用"は文字列を強制的の) {?、{0}} {?、{1}}。
pt_br: Você pode escrever qualquer coisa (use " para forçar o preenchimento){?, {0}}{?, {1}}.

# TemplateUnspecified
source: Unspecified
de_de: Nicht definiert
es: Sin especificar
ja: 指定なし
pt_br: Não informado

# TemplateConfirmation
source: Is this your selection? {*}
de_de: Ist das deine Auswahl? {*}
es: ¿Es la selección? {*}
ja: これはあなたの選択ですか。 {*}
pt_br: Está correto? {*}

# Navigation
source: Field Name
de_de: Feld
es: Nombre de campo
ja: フィールド名
pt_br: Nome do campo

source: too many attempts
de_de: Zu viele Versuche.
es: demasiados intentos de
ja: 回数が多すぎます。
pt_br: muitas tentativas

source: User profile deleted!
de_de: Benutzerprofil gelöscht!
es: Perfil de usuario eliminado!
ja: ユーザー プロファイル削除!
pt_br: Perfil de usuário excluído!

source: Confirmation
de_de: Bestätigung
es: Confirmación
ja: 確認
pt_br: Confirmação

# UnhandledExceptionToUser
source: Sorry, my bot code is having an issue.
de_de: Sorry,mein Bot hat ein Problem.
es: Lo sentimos, que el código de mi bot está teniendo un problema.
ja: 申し訳ありませんが、私のボットのコードは、問題を抱えています。
pt_br: Desculpe, meu código fonte está com um problema.

# NumberOrdinals
source: 1=1st,first,first one|2=2nd,second,second one|3=3rd,third,third one|4=4th,fourth,fourth one|5=5th,fifth,fifth one|6=6th,sixth,sixth one|7=7th,seventh,seventh one|8=8th,eigth,eigth one|9=9th,ninth,ninth one|10=10th,tenth,tenth one
de_de: 1=1.,Erstens erste|2=2.,zweitens das zweite|3=3.,drittens dritte|4=4.,Viertens vierte|5=5.,Fünftens fünfte|6=6. Sechster,sechste|7=7.,siebte,siebte|8=8.,achte,achte man|9=9.,Neunter,neunte ein|10=10,zehnte,zehnte ein
es: 1=1ro,1ra,primer,primero,primera|2=2do,2da,segundo,segunda|3=3ro,3ra,tercero,tercera|4=4to,4ta,cuarto,cuarta|5=5to,5ta,quinto,quinta|6=6to,6ta,sexto,sexta|7=7mo,7ma,séptimo,séptima,septimo,septima|8=8vo,8va,octavo,octava|9=9no,9na,noveno,novena|10=10mo,10ma,décimo,décima,decimo,decima
ja: 1 = 1、最初に、最初の 1 つ | 2 = 第 2 回、第二に、2 つ目の | 3 = 第 3 回、第三に、3 つ目 | 4 = 第 4 回、第四に、4 分の 1 | 5 = 第 5 回、第五に、5 つ | 6 = 6、6、6 1 | 7 = 7、7、セブンス ・ ワン | 8 = 8、8 番目、8 番目の 1 つ | 9 = 9、9、9 1 | 10 = 10、10、10 1 つ
pt_br: 1=primeiro,primeira|2=segundo,segunda|3=terceiro,terceira|4=quarto,quarta|5=quinto,quinta|6=sexto,sexta|7=sétimo,sétima|8=oitavo,oitava|9=nono,nona|10=décimo,décima

# NumberReverseOrdinals
source: -1=last,last one|-2=next to last,second to last,second from last|-3=third to last,third from last|-4=fourth to last,fourth from last|-5=fifth to last,fith from last
de_de: -1=letzter,letzte|-2=neben letzte Sekunde zum letzten,Sekunde aus dem letzten|-3=zum letzten,dritten Drittel aus dem letzten|-4=vierte bis zum letzten,vierten aus dem letzten|-5=zum letzten,fünften Fith aus dem letzten
es: -1=último,última,ultimo,ultima|-2=penúltimo,penúltima,penultimo,penultima|-3=antepenúltimo,antepenúltima,antepenultimo,antepenultima
ja: -1 = 最後に、最後の 1 つ |-2 最後から 2 番目、最後に 2 番目の最後の横にある = |-3 最後から最後に 3 番目 3 番目 = |-4 最後から最後に 4 番目 4 番目 = |-5 = 最後の最後、5 番目のフィス
pt_br: -1=último,última|-2=penúltimo,penúltima|-3=antepenúltimo,antepenúltima

# BooleanChoices
source: true=y,yes,yep,sure,ok,\u1f44d,\u1f44c|false=n,no,nope,\u1f44e,\\u270b,\\u1f590
de_de: True=y,ja,ja,sicher,ok,\u1f44d,\u1f44c|false=n,Nein,Nein,\u1f44e,\\u270b,\\u1f590
es: true=s,si,sip,claro,ok,\u1f44d,\u1f44c|false=n,no,nop,\u1f44e,\\u270b,\\u1f590
ja: true = y、yes、うん、ことを確認して、[ok]、\u1f44d、\u1f44c|false=n、いや、いや、\u1f44e、\\u270b、\\u1f590
pt_br: true=s,sim,isso,correto,certo,ok,\u1f44d,\u1f44c|false=n,não,errado,\u1f44e,\\u270b,\\u1f590

# NumberTerms
source: 0=zero|1=one|2=two|3=three|4=four|5=five|6=six|7=seven|8=eight|9=nine|10=ten|11=eleven|12=twelve|13=thirteen|14=fourteen|15=fifteen|16=sixteen|17=seventeen|18=eighteen|19=nineteen|20=twenty
de_de: 0=Null|1=eins|2=zwei|3=drei|4=vier|5=fünf|6=sechs|7=sieben|8=acht|9=neun|10=10|11=elf|12=zwölf|13=dreizehn|14=14|15=15|16=16|17=17|18=18|19=19|20=20
es: 0=cero|1=uno|2=dos|3=tres|4=cuatro|5=cinco|6=seis|7=siete|8=ocho|9=nueve|10=diez|11=once|12=doce|13=trece|14=catorce|15=quince|16=diesiseis,diesiséis|17=diesisiete|18=diesiocho|19=diesinueve|20=veinte
ja: 0 = 0 | 1 = 1 つ | 2 = 2 | 3 = 3 | 4 = 4 | 5 = 5 | 6 = 6 | 7 = 7 | 8 = 8 | 9 = 9 | 10 = 10 | 11 = 11 | 12 = 12 | 13 = 13 | 14 = 14 | 15 = 15 | 16 = 16 | 17 = 17 | 18 = 18 | 19 = 19 | 20 = 20
pt_br: 0=zero|1=um|2=dois|3=três|4=quatro|5=cinco|6=seis|7=sete|8=oito|9=nove|10=dez|11=onze|12=doze|13=treze|14=quatorze|15=quinze|16=dezesseis|17=dezessete|18=dezoito|19=dezenove|20=vinte
