Repository: microsoft/botbuilder-dotnet
Catalog: libraries/Microsoft.Bot.Builder.Classic/Microsoft.Bot.Builder.Classic/MultilingualResources/Microsoft.Bot.Builder.*.xlf
Languages: ar, cs, it, zh_hans

# CommandBack
source: Back
ar: ارجع
cs: Zpět
it: Indietro
zh_hans: 返回

# CommandBackHelp
source: Back: Go back to the previous question.
ar: ارجع: ارجع إلى السؤال السابق
cs: Zpět: Vrátit se k předchozí otázce.
zh_hans: 返回: 回到上一个问题

# CommandBackTerms
source: backup;go back;back
ar: ارجع
cs: backup;back;zpět;zpet
it: indietro;vai indietro;torna indietro;torna;ritorna
zh_hans: 返回;上去;回去

# CommandHelp
source: Help
ar: مساعدة
cs: Nápověda
it: Aiuto
zh_hans: 提示

# CommandHelpHelp
source: Help: Show the kinds of responses you can enter.
ar: مساعدة: اظهر الاجابات الممكنة
cs: Nápověda: Ukázat typy odpovědí,které můžete zadat.
it: Aiuto: mostra i tipi di risposte che puoi inserire.
zh_hans: 提示: 显示可选回答.

# CommandHelpTerms
source: help;choices;\?
ar: مساعدة; اختيارات; /؟
cs: help;choices;\?;nápověda;napoveda
it: aiuto;help;scelte;\?
zh_hans: 提示;选项;\?

# CommandQuit
source: Quit
ar: اخرج
cs: Konec
it: Esci
zh_hans: 退出

# CommandQuitHelp
source: Quit: Quit the form without completing it.
ar: اخرج بدون اكمال الاستمارة
cs: Konec: Ukončit vyplňování formuláře před dokončením.
it: Esci: esci senza completare il modulo.
zh_hans: 退出: 退出并放弃当前表格

# CommandQuitTerms
source: quit;stop;finish;goodby?;good bye?;bye;ciao;adios;bye-bye;so long;cheers
ar: اخرج; أنهي; توقف; سلام; إلى اللقاء
cs: quit;stop;finish;goodby?;good bye?;bye;ciao;adios;bye-bye;so long;cheers;konec
zh_hans: 退出;停止;结束;再见?;再会?;拜拜;滚

# CommandReset
source: Start over
ar: ابدأ من جديد
cs: Začít znovu
it: Riparti da capo
zh_hans: 从头开始

# CommandResetHelp
source: Reset: Start over filling in the form. (With defaults from your previous entries.)
ar: ابدأ من جديد:ابدا ملئ الاستمارة من جديد
cs: Reset: Začít s vyplňováním znovu od začátku. (Jako výchozí zůstanou vaše předchozí odpovědi.)
it: Riparti: Ricomincia con la compilazione del modulo. (Usando come predefiniti i valori inseriti fino ad ora.)
zh_hans: 从头开始: 从头开始填表. (自动选择之前默认选项.)

# CommandResetTerms
source: start over;reset;clear
ar: ابدا من جديد; ابدا من البداية; ابدا من الاول
cs: start over;reset;clear;začít znovu;znovu;zacit znovu
it: riparti;riavvia;resetta;azzera;pulisci
zh_hans: 从头开始;清零;清除

# CommandStatusHelp
source: Status: Show your progress in filling in the form so far.
ar: الحالة:اظهر موقعك من اكمل الاستمارة
cs: Status: Ukázat,jak postupujete vyplňováním formuláře.
it: Stato: mostra i tuoi progressi nel riempimento del modulo fino ad ora.
zh_hans: 进度: 显示当前填表进展.

# CommandStatusTerms
source: status;progress;so far;results
ar: الحالة; تقدم; نتائج
cs: status;progress;so far;results;stav;postup
it: stato;progresso;finora;risultati
zh_hans: 进度;进展;当前位置;结果

# DefaultChoiceLastSeparator
source: , or
ar: , أو
cs: nebo
zh_hans: , 或

# DefaultLastSeparator
source: , and
ar: , و
cs: a
zh_hans: , 且

# LanguageArticles
source: a;an;the
ar: ال
cs: ten;ta;to
it: un;uno;un';una;il;lo;la;i;gli;le
zh_hans: 一;一个;一只;这;那

# LanguageStopWords
source: a;about;above;above;across;after;afterwards;again;against;all;almost;alone;along;already;also;although;always;am;among;amongst;amoungst;amount;an;and;another;any;anyhow;anyone;anything;anyway;anywhere;are;around;as;at;back;be;became;because;become;becomes;becoming;been;before;beforehand;behind;being;below;beside;besides;between;beyond;bill;both;bottom;but;by;call;can;cannot;cant;co;con;could;couldnt;cry;de;describe;detail;do;done;down;due;during;each;eg;eight;either;eleven;else;elsewhere;empty;enough;etc;even;ever;every;everyone;everything;everywhere;except;few;fifteen;fify;fill;find;fire;first;five;for;former;formerly;forty;found;four;from;front;full;further;get;give;go;had;has;hasnt;have;he;hence;her;here;hereafter;hereby;herein;hereupon;hers;herself;him;himself;his;how;however;hundred;ie;if;in;inc;indeed;interest;into;is;it;its;itself;keep;last;latter;latterly;least;less;ltd;made;many;may;me;meanwhile;might;mill;mine;more;moreover;most;mostly;move;much;must;my;myself;name;namely;neither;never;nevertheless;next;nine;no;nobody;none;noone;nor;not;nothing;now;nowhere;of;off;often;on;once;one;only;onto;or;other;others;otherwise;our;ours;ourselves;out;over;own;part;per;perhaps;please;put;rather;re;same;see;seem;seemed;seeming;seems;serious;several;she;should;show;side;since;sincere;six;sixty;so;some;somehow;someone;something;sometime;sometimes;somewhere;still;such;system;take;ten;than;that;the;their;them;themselves;then;thence;there;thereafter;thereby;therefore;therein;thereupon;these;they;thick;thin;third;this;those;though;three;through;throughout;thru;thus;to;together;too;top;toward;towards;twelve;twenty;two;un;under;until;up;upon;us;very;via;was;we;well;were;what;whatever;when;whence;whenever;where;whereafter;whereas;whereby;wherein;whereupon;wherever;whether;which;while;whither;who;whoever;whole;whom;whose;why;will;with;within;without;would;yet;you;your;yours;yourself;yourselves
cs: a;asice;ato;aby;aj;ale;ani;aniz;aniž;asi;az;až;bez;by;ci;co;coz;což;cz;či;do;ho;i;jako;jen;jenz;jenž;jeste;ještě;ji;jí;jine;jiné;jiz;již;k;kazdy;každý;kdyz;když;ke;ktera;která;ktere;které;kteri;kterou;ktery;který;kteří;ku;mezi;na;ná;nad;nam;nám;nas;nebo;necht;nechť;nez;než;ni;nicméně;ní;o;od;ode;on;pak;po;pod;podle;pokud;pouze;prave;právě;pres;pri;pro;proc;proč;prosim;prosím;proto;protoze;protože;před;přede;přes;při;re;s;se;si;sice;ta;tak;take;také;takze;takže;tato;te;té;tedy;těma;ten;tento;teto;této;tim;tím;timto;tímto;to;tohle;toho;tohoto;tom;tomto;tomuto;toto;tu;tuto;tyto;u;uz;už;v;vam;vám;vas;vase;váš;vaše;ve;vice;více;vlastni;vlastní;vsak;však;všichni;vsichni;všechen;vsechen;z;za;zda;zde;ze;ze;že

# MatchCurrentChoice
source: Current Choice('c');current;c;current choice;no change
ar: الاختيار الحالي
cs: Současná volba ('s');současná;současná volba;aktuální;s;aktuální volba;beze změny
it: Scelta Corrente ("s");corrente;s;scelta corrente;non cambiare;nessun cambio
zh_hans: 照样('c');原样;一样;老样子;照旧;老规矩

# MatchNo
source: No;n;nope;2
ar: لا
cs: Ne;n;2
it: No;n;2
zh_hans: 不;不是;不对;不要;2

# MatchNoPreference
source: No Preference;no;none;I don'?t care
ar: أي شيء; لا تفرق; لا تفضيل
cs: Bez preference;žádná;žádné;žádný;je mi to jedno
it: Nessuna preferenza;no;nessuna;non importa
zh_hans: 随便;不足道;都可以;随意

# MatchYes
source: Yes;y;sure;ok;yep;1
ar: نعم
cs: Ano;a;jistě;zajisté;ok;jo;1
it: Sì;si;yes;y;s;sicuro;ok;1
zh_hans: 是;好;行;ok;k;对;1

# PromptRetry
source: I didn't understand. Say something in reply.
ar: لا أفهم, قل شيء
cs: Tomu nerozumím,zkuste to ještě jednou.
it: Non ho capito. Rispondi qualcosa.
zh_hans: 不好意思，我没听懂. 请换一种表达

# TemplateBool
source: Would you like a {&}? {||}
ar: هل تحب {&}? {||}
cs: Chcete {&}? {||}
it: Desideri {&}? {||}
zh_hans: 您是需要 {&}? {||}

# TemplateBoolHelp
source: Please enter 'yes' or 'no'{?, {0}}.
ar: رجاءا ادخل 'نعم' أو 'لا'{?, {0}}.
cs: Zadejte prosím "ano",nebo "ne"{?,{0}}.
it: Inserisci "si" oppure "no"{?,{0}}.
zh_hans: 请选择 '是' 或 '否'{?, {0}}.

# TemplateClarify
source: By "{0}" {&} did you mean {||}
ar: بقولك "{0}" {&} هل كنت تعني {||}
cs: Když říkáte "{0}",myslíte tím {&}? {||}
it: Cosa intendevi con "{0}",come valore per il campo "{&}"? {||}
zh_hans: "{0}" {&} 是 {||}的意思吗

# TemplateCurrentChoice
source: (current choice: {})
ar: (الخيار الحالي: {})
cs: (aktuální volba: {})
it: (scelta corrente: {})
zh_hans: (当前选择: {})

# TemplateDateTime
source: Please enter a date and time for {&} {||}
ar: رجاءا ادخل يوم وموعد {&} {||}
cs: Zadejte prosím datum a čas pro položku {&} {||}
it: Inserisci data e ora per {&} {||}
zh_hans: 请选择 {&} 的日期和时间 {||}

# TemplateDateTimeHelp
source: Please enter a date or time expression {?, {0}}{?, {1}}.
ar: رجاءا ادخل تعبير يوم ووقت {?, {0}}{?, {1}}.
cs: Zadejte prosím správně formátované datum nebo čas {?,{0}}{?,{1}}.
it: Inserisci un valore per la data o l'ora {?,{0}}{?,{1}}.
zh_hans: 请输入正确的日期时间格式 {?, {0}}{?, {1}}.

# TemplateDouble
source: Please enter a number {?between {0:F1} and {1:F1}} for {&} {||}
ar: رجاءا ادخل رقم {?بين {0:F1} و {1:F1}} لاجل {&} {||}
cs: Zadejte prosím číslo {?mezi {0:F1} a {1:F1}} pro položku {&} {||}
it: Inserisci un numero {?tra {0:F1} e {1:F1}} per {&} {||}
zh_hans: 请选择{&} {||} {?between {0:F1} 至 {1:F1}} 的数字

# TemplateDoubleHelp
source: Please enter a number{? between {2:F1} and {3:F1}}{?, {0}}{?, {1}}.
ar: رجاءا ادخل رقم{? بين {2:F1} و {3:F1}}{?, {0}}{?, {1}}.
cs: Zadejte prosím číslo{? mezi {2:F1} a {3:F1}}{?,{0}}{?,{1}}.
zh_hans: 请选择{? {2:F1} 至 {3:F1}}{?, {0}}{?, {1}}.

# TemplateEnumManyNumberHelp
source: You can enter one or more numbers {0}-{1} or words from the descriptions. ({2})
ar: يمكنك ادخل أكثر من رقم {0}-{1} أو كلمة من الوصف. ({2})
cs: Můžete zadat jedno nebo více čísel {0}-{1},případně slova z nabídnutých popisků. ({2})
it: Puoi inserire uno o più numeri ({0}-{1}) oppure parole presenti nelle descrizioni. ({2})
zh_hans: 您可以选择以下任意一项或多项 {0}-{1}的数字或名称. ({2})

# TemplateEnumManyWordHelp
source: You can enter in one or more selections from the descriptions. ({2})
ar: يمكنك ادخال أكثر من خيار من الوصف. ({2})
cs: Můžete zadat jednu nebo více voleb z nabídnutých popisků. ({2})
it: Puoi inserire una o più scelte prese dalle descrizioni. ({2})
zh_hans: 您可以选择以下任意一项或多项. ({2})

# TemplateEnumOneNumberHelp
source: You can enter a number {0}-{1} or words from the descriptions. ({2})
ar: يمكنك اخدال رقم {0}-{1} أو كلمات من الوصف. ({2})
cs: Můžete zadat číslo {0}-{1} nebo slova z nabídnutých popisků. ({2})
it: Puoi inserire un numero ({0}-{1}) oppure parte di una delle descrizioni. ({2})
zh_hans: 您可以选择以下任意一项 {0}-{1}的数字或名称. ({2})

# TemplateEnumOneWordHelp
source: You can enter in any words from the descriptions. ({2})
ar: يمكنك ادخال أي كلمات من الوصف. ({2})
cs: Můžete zadat jakákoliv slova z nabídnutých popisků. ({2})
it: Puoi inserire qualunque parola presente nelle descrizioni. ({2})
zh_hans: 您可以选择以下任意一项. ({2})

# TemplateEnumSelectMany
source: Please select one or more {&} {||}
ar: رجاءا اختار خيارا أو أكتر {&} {||}
cs: Vyberte prosím jednu nebo více voleb {&} {||}
it: Seleziona uno o più valori per il campo "{&}" {||}

# TemplateEnumSelectOne
source: Please select a {&} {||}
ar: رجاءا اختار {&} {||}
cs: Vyberte prosím {&} {||}
it: Seleziona un valore per il campo "{&}" {||}
zh_hans: 请选择 {&} {||}

# TemplateFeedback
source: For {&} I understood {}. {?"{0}" is not an option.}
ar: لاجل {&} فهمت {}. {?"{0}" ليس خيارا.}
cs: {&} chápu jako {}. {?"{0}" není na výběr.}
zh_hans: 您可以用{}告诉我{&}. {?"{0}" 不是可选选项.}

# TemplateHelp
source: You are filling in the {&} field. Possible responses: {0} {1}
ar: انت تملأ الخانة: {&}. الاجابات الممكنة: {0} {1}
cs: Vyplňujete položku {&}. Možné varianty: {0} {1}
it: Stai valorizzando il campo "{&}". Risposte possibili: {0} {1}
zh_hans: 您正在选择 {&} 项. 可选: {0} {1}

# TemplateHelpClarify
source: You are clarifying a {&} value. Possible responses: {0} {1}
ar: انت توضح قيمة: {&}. الخيارات الممكنة: {0} {1}
cs: Upřesňujete položku {&}. Možné varianty: {0} {1}
it: Stai chiarendo un valore per il campo "{&}". Risposte possibili: {0} {1}
zh_hans: 请确认{&}选项. 可选答案为: {0} {1}

# TemplateHelpConfirm
source: Please answer the question. Possible responses: {0} {1}
ar: رجاءا اجب السوال. الخيارات الممكنة: {0} {1}
cs: Odpovězte prosím na otázku. Možné varianty: {0} {1}
it: Rispondi alla domanda. Risposte possibili: {0} {1}
zh_hans: 请您选择， 可选答案为: {0} {1}

# TemplateHelpNavigation
source: Choose what field to change. Possible responses: {0} {1}
ar: اختر أي خانة تريد تغيرها. الاختيارات الممكنة: {0} {1}
cs: Zvolte,které pole chcete změnit. Možné varianty: {0} {1}
it: Scegli quale campo modificare. Risposte possibili: {0} {1}
zh_hans: 请选择栏目. 可选选项为: {0} {1}

# TemplateInteger
source: Please enter a number{? between {0} and {1}} for {&} {||}
ar: رجاءا ادخل رقم {? بين {0} و {1}} لاجل {&} {||}
cs: Zadejte prosím číslo {? mezi {0} a {1}} pro položku {&} {||}
it: Inserisci un numero{? tra {0} e {1}} per {&} {||}
zh_hans: 请选择 {&} {||} {? {0} 至 {1} 的数字}

# TemplateIntegerHelp
source: You can enter a number{? between {2} and {3}}{?, {0}}{?, {1}}.
ar: يمكنك ادخال رقم {? بين {2} و {3}}{?, {0}}{?, {1}}.
cs: Můžete zadat číslo{? mezi {2} a {3}}{?,{0}}{?,{1}}.
it: Puoi inserire un numero{? tra {2} e {3}}{?,{0}}{?,{1}}.
zh_hans: 您可以选择{? {2} 至 {3}的数字}{?, {0}}{?, {1}}.

# TemplateNavigation
source: What do you want to change? {||}
ar: ماذا تريد ان تغير? {||}
cs: Co si přejete změnit? {||}
it: Cosa vuoi cambiare? {||}
zh_hans: 您需要更改哪一栏? {||}

# TemplateNavigationCommandHelp
source: You can switch to another field by entering its name. ({0}).
ar: يمكنك الانتقال إلى خانة أخرى عن طريق ادخل اسمها. ({0}).
cs: Na jinou položku se přepnete tím,že napíšete její název. ({0}).
it: Puoi passare ad un altro campo inserendo il suo nome. ({0}).
zh_hans: 您可以输入栏目名称直接进入. ({0}).

# TemplateNavigationHelp
source: Choose {?a number from {0}-{1}, or} a field name.
ar: اختار {?رقم من {0}-{1}, or} اسم خانة.
cs: Zvolte {?číslo v rozsahu {0}-{1} nebo} název položky.
it: Scegli {?un numero da {0}-{1} oppure} il nome di un campo.
zh_hans: 选择 {? {0}-{1} 的数字或} 选项名称.

# TemplateNoPreference
source: No Preference
ar: لا تفضيل
cs: Bez preference
it: Nessuna preferenza
zh_hans: 随便

# TemplateNotUnderstood
source: "{0}" is not a {&} option.
ar: "{0}" ليس {&} خيار.
cs: "{0}" není platná volba pro {&}.
zh_hans: "{0}" 不是 {&}的选项.

# TemplateString
source: Please enter {&} {||}
ar: رجاءا ادخل {&} {||}
cs: Zadejte prosím {&} {||}
it: Inserisci {&} {||}
zh_hans: 请输入 {&} {||}

# TemplateStringHelp
source: You can enter anything (use "'s to force string){?, {0}}{?, {1}}.
ar: يمكنك ادخال أي شيء (استخدم ' لإجبار كلام){?, {0}}{?, {1}}.
cs: Můžete zadat cokoliv (řetězec vynutíte pomocí uvozovek "){?,{0}}{?,{1}}.
it: Puoi inserire qualunque cosa (usa " per indicare del testo){?,{0}}{?,{1}}.
zh_hans: 您可以在"'s后面自由输入{?, {0}}{?, {1}}.

# TemplateUnspecified
source: Unspecified
ar: غير محدد
cs: Neuvedeno
it: Non specificato
zh_hans: 随便

# TemplateConfirmation
source: Is this your selection? {*}
cs: Je tohle vaše volba? {*}

# Navigation
source: Field Name
ar: اسم الحقل
cs: Název položky
it: Nome campo
zh_hans: 字段名称

source: too many attempts
cs: příliš mnoho pokusů

source: User profile deleted!
cs: Profil uživatele byl smazán!

source: Confirmation
ar: تأكيد
cs: Potvrzení
it: Conferma
zh_hans: 确认

# UnhandledExceptionToUser
source: Sorry, my bot code is having an issue.
cs: Omlouvám se,můj botí kód má potíže.

# CommandStatus
source: Status
ar: الحالة
it: Stato
zh_hans: 进度
